---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthsDisplayOption
source: html/b9907d6a-fc0b-7c68-0439-08bf1629f2d7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthsDisplayOption Property

"Straight Segment Lengths"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeSegmentLengthsDisplayOption { get; }
```